Revit 2027 API
ExportLayerInfo.CutLayerName Property
 The cut layer name stored in value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string CutLayerName { get; set; }
Public Property CutLayerName As String
	Get
	Set
public:
property String^ CutLayerName {
	String^ get ();
	void set (String^ value);
}
member CutLayerName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLayerInfo Class
Autodesk.Revit.DB Namespace